Repository: strax88/boenergo_project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Admin panel for the QuadraticEquationSolving model
ru: Панель администратора для модели QuadraticEquationSolving

source: Form: Solving the quadratic equation
ru: Форма: Решение квадратного уравнения

source: Coefficient 'a'
ru: Коэффициент 'a'

source: Coefficient 'b'
ru: Коэффициент 'b'

source: Coefficient 'c'
ru: Коэффициент 'c'

source: Basic and additional validations
ru: Основная и дополнительная валидации

source: Get a feature `linear`
ru: Получить признак `linear`

source: Get a feature `non_solution`
ru: Получить признак `non_solution`

source: Get a feature `one_solution`
ru: Получить признак `one_solution`

source: Get a feature `two_solutions`
ru: Получить признак `two_solutions`

source: Fill data for rendered template
ru: Заполните данные для отображаемого шаблона

source: Solving the quadratic equation
ru: Решение квадратного уравнения

source: GET-method handler
ru: Обработчик GET-метода

source: POST-method handler
ru: Обработчик POST-метода

source: API: Solving the quadratic equation
ru: API: Решение квадратного уравнения

source: Get raw coefficient data from request
ru: Получение необработанных данных о коэффициентах из запроса

source: Serializer: Solving the quadratic equation
ru: Сериализатор: Решение квадратного уравнения

source: Module for finding solutions to quadratic equations
ru: Модуль нахождения решений квадратных уравнений

source: General class of exceptions by coefficient value
ru: Общий класс исключений по значению коэффициента

source: Base coefficient value error {coefficient_name}: {coefficient_value}
ru: Базовая ошибка значения коэффициента {coefficient_name}: {coefficient_value}

source: Class of exceptions based on an empty coefficient value
ru: Класс исключений по пустому значению коэффициента

source: Empty value `{coefficient_name}`: {coefficient_value}
ru: Пустое значение `{coefficient_name}`: {coefficient_value}

source: Class of exceptions based on the zero value of the coefficient
ru: Класс исключений по нулевому значению коэффициента

source: Zero value `{coefficient_name}`: {coefficient_value}
ru: Нулевое значение `{coefficient_name}`: {coefficient_value}

source: Class of exceptions for incorrect coefficient value
ru: Класс исключений по неправильному значению коэффициента

source: Wrong value `{coefficient_name}`: {coefficient_value}
ru: Неправильное значение `{coefficient_name}`: {coefficient_value}

source: Class of exceptions by infinite coefficient value
ru: Класс исключений по бесконечному значению коэффициента

source: Infinity value `{coefficient_name}`: {coefficient_value}
ru: Бесконечное значение `{coefficient_name}`: {coefficient_value}

source: Model: Solution of the quadratic equation
ru: Модель: Решение квадратного уравнения

source: Discriminant
ru: Дискриминант

source: The first root of the equation `X1`
ru: Первый корень уравнения `X1`

source: The first root of the equation `X2`
ru: Второй корень уравнения `X2`

source: Solutions of quadratic equations
ru: Решения квадратных уравнений

source: Service: Solving the quadratic equation
ru: Служба: Решение квадратного уравнения

source: Solution of the equation
ru: Решение уравнения

source: Converting coefficients to real numbers and packing into namedtuple
ru: Преобразование коэффициентов к вещественным числам и упаковка в namedtuple

source: Fetching data from the database or adding data to the database
ru: Выборка данных из базы или добавление данных в базу

source: Data validation - coefficients `a` and `b` are present and not equal to zero; - coefficients are not equal to infinity; - coefficients are real numbers;
ru: Валидация данных - коэффициенты `a` и `b` присутствуют и не равны нулю; - коэффициенты не равны бесконечности; - коэффициенты являются вещественными числами;

source: Solving a linear equation
ru: Решение линейного уравнения

source: Checking the value for belonging to real numbers (except for infinities)
ru: Проверка значения на принадлежность к вещественным числам (за исключением бесконечностей)

source: Finding the discriminant
ru: Поиск дискриминанта

source: Finding the first root of the equation
ru: Поиск первого корня уравнения

source: Finding the second root of the equation
ru: Поиск второго корня уравнения

source: Finding the solutions of the equation
ru: Поиск корней уравнения

source: General view of the quadratic equation
ru: Общий вид квадратного уравнения

source: By
ru: При

source: the equation becomes linear
ru: уравнение становится линейным

source: and is calculated by the formula
ru: и вычисляется по формуле

source: To find the roots of the equation , it is necessary to find the discriminant
ru: Для нахождения корней уравнения необходимо найти дискриминант

source: If
ru: Если

source: the equation has no roots
ru: уравнение не имеет корней

source: the equation has one root
ru: уравнение имеет один корень

source: the equation has two roots
ru: уравнение имеет два корня

source: Find a solution
ru: Найти решение

source: Reset
ru: Сброс
